#pragma once

/// <summary>
/// ゲームで使用するサウンドのバーチャルIDを定義する。
/// 現在は必要そうなものだけ定義しているが、
/// 実際に使用するサウンドが増えたら、ここに追加
/// </summary>
enum class SoundID
{
    // ------------------------------------------------------------------------------
    // BGM
    // ------------------------------------------------------------------------------
    BGM_Title,
    BGM_Game,
    BGM_GameOver,

    // ------------------------------------------------------------------------------
    // SE
    // ------------------------------------------------------------------------------
    SE_BallHit,
    SE_EnemyDead,

    Count,
};